app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "banana"], ["last_name", "moon"], ["updated_at", "2020-10-30 04:52:19.184871"], ["id", 1]]
---
    def update
        @student.update(student_params)